openfoam_ex/karmanVortex/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inflow
    {
        type           codedFixedValue;
        value          uniform (1.0 0 0);

        name           parabolicVelocity;
        code 
        #{
            const vectorField& Cf = patch().Cf();
            vectorField& field = *this;

            const scalar Umax = 1.0;
            forAll(Cf, faceI)
            {
                const scalar y = Cf[faceI][1];
                field[faceI] = vector(Umax*(1-(((y-0.5)/0.5)*((y-0.5)/0.5))),0,0);
            }
        #};
    }

    outflow
    {
        type            zeroGradient;
    }

    topAndBottom
    {
        type            noSlip;
    }

    obstacle
    {
        type            noSlip;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
