openfoam_ex/karmanVortex/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (4 0 0)
    (6 0 0)
    (10 0 0)
    (50 0 0)

    (0 4 0)
    (4 4 0)
    (6 4 0)
    (10 4 0)
    (50 4 0)

    (0 6 0)
    (4 6 0)
    (6 6 0)
    (10 6 0)
    (50 6 0)

    (0 10 0)
    (4 10 0)
    (6 10 0)
    (10 10 0)
    (50 10 0)

    (0 0 1)
    (4 0 1)
    (6 0 1)
    (10 0 1)
    (50 0 1)

    (0 4 1)
    (4 4 1)
    (6 4 1)
    (10 4 1)
    (50 4 1)

    (0 6 1)
    (4 6 1)
    (6 6 1)
    (10 6 1)
    (50 6 1)

    (0 10 1)
    (4 10 1)
    (6 10 1)
    (10 10 1)
    (50 10 1)

);
// n_cells_x 10;
// n_cells_y 10;

blocks
(
    hex (0 1 6 5 20 21 26 25) (40 40 1) simpleGrading (1 1 1)
    hex (1 2 7 6 21 22 27 26) (20 40 1) simpleGrading (1 1 1)
    hex (2 3 8 7 22 23 28 27) (40 40 1) simpleGrading (1 1 1)

    hex (3 4 9 8 23 24 29 28) (200 40 1) simpleGrading (1 1 1)

    hex (5 6 11 10 25 26 31 30) (40 20 1) simpleGrading (1 1 1)
    hex (7 8 13 12 27 28 33 32) (40 20 1) simpleGrading (1 1 1)

    hex (8 9 14 13 28 29 34 33) (200 20 1) simpleGrading (1 1 1)

    hex (10 11 16 15 30 31 36 35) (40 40 1) simpleGrading (1 1 1)
    hex (11 12 17 16 31 32 37 36) (20 40 1) simpleGrading (1 1 1)
    hex (12 13 18 17 32 33 38 37) (40 40 1) simpleGrading (1 1 1)

    hex (13 14 19 18 33 34 39 38) (200 40 1) simpleGrading (1 1 1)

);

radius 1.414214;
edges
(
    arc 6 7 (5 #calc "(5-$radius)" 0)
    arc 26 27 (5 #calc "(5-$radius)" 1)

    arc 7 12 (#calc "(5+$radius)" 5 0)
    arc 27 32 (#calc "(5+$radius)" 5 1)

    arc 11 12 (5 #calc "(5+$radius)" 0)
    arc 31 32 (5 #calc "(5+$radius)" 1)

    arc 6 11 (#calc "(5-$radius)" 5 0)
    arc 26 31 (#calc "(5-$radius)" 5 1)

);

boundary
(
    inflow
    {
        type patch;
        faces
        (
            (0 5 20 25)
            (5 10 25 30)
            (10 15 30 35)
        );
    }
    outflow
    {
        type patch;
        faces
        (
            (4 9 24 29)
            (9 14 29 34)
            (14 19 34 39)
        );
    }
    topAndBottom
    {
        type wall;
        faces
        (
            (0 1 20 21)
            (1 2 21 22)
            (2 3 22 23)
            (3 4 23 24)

            (15 16 35 36)
            (16 17 36 37)
            (17 18 37 38)
            (18 19 38 39)
        );
    }

    obstacle
    {
        type wall;
        faces
        (
            (6 7 26 27)
            (7 12 27 32)
            (11 12 31 32)
            (6 11 26 31)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 6)
            (1 2 6 7)
            (2 3 7 8)
            (3 4 8 9)

            (5 6 10 11)
            (7 8 12 13)
            (8 9 13 14)

            (10 11 15 16)
            (11 12 16 17)
            (12 13 17 18)
            (13 14 18 19)

            (20 21 25 26)
            (21 22 26 27)
            (22 23 27 28)
            (23 24 28 29)

            (25 26 30 31)
            (27 28 32 33)
            (28 29 33 34)

            (30 31 35 36)
            (31 32 36 37)
            (32 33 37 38)
            (33 34 38 39)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
